examples/tumor_chip_linear_gradient/data/diagnostic/cases/run_opposing_none_H200_1777224951598_64085_a1105a/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet_drug
    {
        type            patch;
        nFaces          10;
        startFace       11770;
    }
    inlet_medium
    {
        type            patch;
        nFaces          10;
        startFace       11780;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       11790;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       11820;
    }
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       11830;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12000;
        startFace       12230;
    }
)

// ************************************************************************* //
