examples/tumor_chip_linear_gradient/data/diagnostic/cases/run_opposing_none_H200_1777224951598_64085_a1105a/system/blockMeshDict
        FoamFile
        {
            version     2.0;
            format      ascii;
            class       dictionary;
            object      blockMeshDict;
        }

        convertToMeters 0.001;

        vertices
        (
    (0.000000 0.000000 0.000000)
    (10.000000 0.000000 0.000000)
    (0.000000 0.200000 0.000000)
    (10.000000 0.200000 0.000000)
    (0.000000 0.700000 0.000000)
    (10.000000 0.700000 0.000000)
    (0.000000 0.800000 0.000000)
    (10.000000 0.800000 0.000000)
    (0.000000 1.300000 0.000000)
    (10.000000 1.300000 0.000000)
    (0.000000 1.500000 0.000000)
    (10.000000 1.500000 0.000000)
    (0.000000 0.000000 0.010000)
    (10.000000 0.000000 0.010000)
    (0.000000 0.200000 0.010000)
    (10.000000 0.200000 0.010000)
    (0.000000 0.700000 0.010000)
    (10.000000 0.700000 0.010000)
    (0.000000 0.800000 0.010000)
    (10.000000 0.800000 0.010000)
    (0.000000 1.300000 0.010000)
    (10.000000 1.300000 0.010000)
    (0.000000 1.500000 0.010000)
    (10.000000 1.500000 0.010000)
        );

        blocks
        (
    hex (0 1 3 2 12 13 15 14) (200 4 1) simpleGrading (1 1 1)
    hex (2 3 5 4 14 15 17 16) (200 10 1) simpleGrading (1 1 1)
    hex (4 5 7 6 16 17 19 18) (200 2 1) simpleGrading (1 1 1)
    hex (6 7 9 8 18 19 21 20) (200 10 1) simpleGrading (1 1 1)
    hex (8 9 11 10 20 21 23 22) (200 4 1) simpleGrading (1 1 1)
        );

        edges ();

        boundary
        (
inlet_drug
{
    type patch;
    faces
    (
                (2 14 16 4)
    );
}
inlet_medium
{
    type patch;
    faces
    (
                (6 18 20 8)
    );
}
outlet
{
    type patch;
    faces
    (
                (1 3 15 13)
(3 5 17 15)
(5 7 19 17)
(7 9 21 19)
(9 11 23 21)
    );
}
walls
{
    type wall;
    faces
    (
                (0 12 14 2)
(4 16 18 6)
(8 20 22 10)
    );
}
floor
{
    type wall;
    faces
    (
                (0 1 13 12)
(10 22 23 11)
    );
}
frontAndBack
{
    type empty;
    faces
    (
                (0 2 3 1)
(2 4 5 3)
(4 6 7 5)
(6 8 9 7)
(8 10 11 9)
(12 13 15 14)
(14 15 17 16)
(16 17 19 18)
(18 19 21 20)
(20 21 23 22)
    );
}
        );

        mergePatchPairs ();
